app/Controllers/Auth/Login.php


        if (!$user || !password_verify($password, $user['password_hash'])) {                    //Jika tidak ada user atau password tidak sesuai
            //Masukkan Ke Log/Riwayah Login Dengan Status /is_success false (gagal)
            $LoginLogModel->save([
                'user_id'         => $user['id'] ?? null,                                       //Masukkan data di kolom user_id jika email yang di inputkan benar maka akan ada idnya jika email salah maka id nya di isi null
                'ip_address'      => $this->request->getIPAddress(),                            //Masukkan data di kolom ip_address diambil dari ip_adress pengunjung yang login menggunakan fungsi bawaan ci4
                'user_agent'      => $this->request->getUserAgent()->getAgentString(),          //Masukkan data di kolom user_agent (login pakai browser tipe apa),dengan fungsi yang sudah di sediakan ci4
                'is_success'      => false,                                                     //Masukkan data false di kolom is_success
                'credential_used' => $email,                                                    //Masukkan email yang di inputkan oleh pengunjung ke kolom credential_used
            ]);
            //AMBIL DATA DARI TABEL LOG UNTUK DITAMPILKAN JUMLAH KEGAGALAN LOGIN DI HALAMAN LOGIN
            $TanggalBerhasilLoginTerakhir = $LoginLogModel->where(['ip_address' => $this->request->getIPAddress(), 'is_success' => true])->orderBy('id', 'DESC')->first()['login_at'] ?? '1970-01-01';
            $JumlahKegagalanLogin = $LoginLogModel->where(['ip_address' => $this->request->getIPAddress(), 'is_success' => false, 'login_at >' => $TanggalBerhasilLoginTerakhir])->countAllResults();
---
INSERT INTO "auth"."login_logs" ("user_id", "ip_address", "user_agent", "is_success", "credential_used") VALUES (NULL, '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/138.0.0.0 Safari/537.36', FALSE, 'isnansetiawan160@gmail.com')
SELECT *
FROM "auth"."login_logs"
WHERE "ip_address" = '::1'
AND "is_success" = TRUE
ORDER BY "id" DESC
 LIMIT 1
SELECT COUNT(*) AS "numrows"
FROM "auth"."login_logs"
WHERE "ip_address" = '::1'
AND "is_success" = FALSE
AND "login_at" > '1970-01-01'

        $sesi->set($datasesi);                                                                  //Set ke session

        //Masukkan Ke Log/Riwayah Login Dengan Status /is_success true (Berhasil)
        $LoginLogModel->save([
            'user_id'    => $user['id'],                                                        //Masukkan data di kolom user_id jika email yang di inputkan benar maka akan ada idnya jika email salah maka id nya di isi null
            'ip_address' => $this->request->getIPAddress(),                                     //Masukkan data di kolom ip_address diambil dari ip_adress pengunjung yang login menggunakan fungsi bawaan ci4
            'user_agent' => $this->request->getUserAgent()->getAgentString(),                   //Masukkan data di kolom user_agent (login pakai browser tipe apa),dengan fungsi yang sudah di sediakan ci4
            'is_success' => true,                                                               //Masukkan data true di kolom is_success
            'credential_used' => $email,                                                        //Masukkan email yang di inputkan oleh pengunjung ke kolom credential_used
        ]);
---
INSERT INTO "auth"."login_logs" ("user_id", "ip_address", "user_agent", "is_success", "credential_used") VALUES ('7', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36', TRUE, 'teger')