app/Filters/AntiBruteForce.php

SELECT *
FROM "auth"."login_logs"
WHERE "ip_address" = '::1'
AND "is_success" = TRUE
ORDER BY "id" DESC
 LIMIT 1
---
    public function before(RequestInterface $request, $arguments = null)            // Before method is called before the controller method
    {
        $logModel = new LoginLogModel();                                            // LoginLogModel digunakan untuk mencatat log login pengguna
        $IpBlockModel = new IpBlockModel();                                         // IpBlockModel digunakan untuk memblokir IP pengguna yang melakukan percobaan login berulang kali
        $ipAddress = $request->getIPAddress();                                      // Mendapatkan alamat IP pengguna dari permintaan HTTP
        $response = service('response');                                            // Mendapatkan instance dari service response untuk mengirimkan respons HTTP

        // TAHAP 1 => CEK IP PENGGUNA APAKAH DI BLOKIR ATAU TIDA DENGAN TANDA DI TABEL IP BLOCK ADA IP PENGGUNA
        if ($IpBlockModel->isIpBlocked($ipAddress)) { //Cek di tabel IpBlockModel apakah IP pengguna sudah ada didalamnya
            session()->setFlashdata('Pesan_kirimke_halaman_locked_via_url', 'Alamat IP Anda telah diblokir secara permanen.');
            if ($request->isAJAX()) {
                return $response->setJSON(['Pesan_kirimke_ajax' => 'Anda tidak bisa login Selama lamanya :D', 'lempar_ke_url' => base_url('locked')]);
            } else {
                return redirect()->to(base_url('locked'));
            }
        }

        //JIKA IP PENGGUNA TIDAK ADA DI TABEL IP BLOCK MAKA LANJUT KE TAHAP 2
        //TAHAP KE 2 =>
        //AMBIL DATA TERAHIR KALI DIA LOGIN TERUS SUKSES--->AMBIL SATU BARIS DATA TERAHIR
        $terahirsukses = $logModel->where(['ip_address' => $ipAddress, 'is_success' => true])->orderBy('id', 'DESC')->first();