app/Filters/FilterCekPercobaanLogin.php

    public function before(RequestInterface $request, $arguments = null)
    {
        //load model
        $logModel = new LoginLogModel();
        $IpBlockModel = new IpBlockModel();
        $ipAddress = $request->getIPAddress();
        $response = service('response');

        // TAHAP 1 => CEK IP PENGGUNA APAKAH DI BLOKIR ATAU TIDA DENGAN TANDA DI TABEL IP BLOCK ADA IP PENGGUNA
        //jika $ipadres itu yang ngakses itu sudah ada di tabel blockip
        //kalau gak false atau null maka --->
        if ($IpBlockModel->isIpBlocked($ipAddress)) {
            //tampilkan pesan ini kita set ke dalam setFlashdata
            session()->setFlashdata('lock_message', 'Alamat IP Anda telah diblokir secara permanen.');

            if ($request->isAJAX()) {
                //JIKA DIA NGAKSES LEWAT PERMINTAAN AJAX MAKA
                //KITA AKAN ARAHIN KE HALAMAN LOCKED DENGAN PESAN PERMANENT = 'lock_type' = 'permanent'
                return $response->setJSON(['lock_type' => 'permanent', 'redirect_url' => base_url('locked')]);
            } else {
                //kalau dia ngakses baseurl tidak melalui ajax maka
                return redirect()->to(base_url('locked'));
            }
        }

        //KALAU TIDAK ADA DATA DI TABEL IP BLOCK MAKA LANJUT-->
        //TAHAP KE 2 =>
        //AMBIL DATA TERAHIR KALI DIA LOGIN TERUS SUKSES--->AMBIL SATU BARIS DATA TERAHIR
        $lastSuccess = $logModel->where(['ip_address' => $ipAddress, 'is_success' => true])->orderBy('id', 'DESC')->first();
---
SELECT *
FROM "auth"."login_logs"
WHERE "ip_address" = '::1'
AND "is_success" = TRUE
ORDER BY "id" DESC
 LIMIT 1