app/Controllers/DashboardController.php

SELECT COUNT(*) AS "numrows"
FROM "mahasiswa"
SELECT COUNT(*) AS "numrows"
FROM "dosen"
SELECT COUNT(*) AS "numrows"
FROM "jurusan"
SELECT COUNT(*) AS "numrows"
FROM "mata_kuliah"
SELECT *
FROM "mahasiswa"
WHERE "user_id" = '18'
 LIMIT 1
---
    public function index()
    {
        $role = session()->get('ses_role');
        $data = ['title' => 'Dashboard'];

        if ($role == 'admin') {
            // Panggil semua model yang dibutuhkan
            $mahasiswaModel = new MahasiswaModel();
            $dosenModel = new DosenModel();
            $jurusanModel = new JurusanModel();
            $mataKuliahModel = new MataKuliahModel();

            // Hitung jumlah data dan tambahkan ke array $data
            $data['jumlah_mahasiswa'] = $mahasiswaModel->countAllResults();
            $data['jumlah_dosen'] = $dosenModel->countAllResults();
            $data['jumlah_jurusan'] = $jurusanModel->countAllResults();
            $data['jumlah_matakuliah'] = $mataKuliahModel->countAllResults();

            return view('dashboard/admin', $data);

        } elseif ($role == 'dosen') {
            return view('dashboard/dosen', $data);

        } elseif ($role == 'mahasiswa') {
            // --- LOGIKA BARU UNTUK MAHASISWA ---
            helper('nilai'); // Panggil helper yang akan kita buat
            $mahasiswaModel = new MahasiswaModel();
            $krsModel = new KrsModel();

            $userId = session()->get('ses_user_id');
            $mahasiswa = $mahasiswaModel->where('user_id', $userId)->first();