app/Controllers/Khs.php

    public function index()
    {
        $mahasiswaModel = new MahasiswaModel();

        $userId = session()->get('ses_user_id');
        $mahasiswa = $mahasiswaModel->where('user_id', $userId)->first();
---
SELECT *
FROM "mahasiswa"
WHERE "user_id" = '18'
 LIMIT 1