app/Controllers/Krs.php

SELECT *
FROM "mahasiswa"
WHERE "user_id" = '18'
 LIMIT 1
SELECT *
FROM "tahun_akademik"
WHERE "status" = 1
 LIMIT 1
SELECT *
FROM "mata_kuliah"
WHERE "jurusan_id" = '9'
AND "semester" IN (1,3,5,7)
---
    public function index()
    {
        $mahasiswaModel = new MahasiswaModel();
        $taModel = new TahunAkademikModel();
        $matakuliahModel = new MataKuliahModel();
        $krsModel = new KrsModel();

        $userId = session()->get('ses_user_id');
        $mahasiswa = $mahasiswaModel->where('user_id', $userId)->first();

        $ta_aktif = $taModel->where('status', 1)->first();

        $matakuliahTersedia = [];
        if ($ta_aktif) {
            // Tentukan jenis semester (Ganjil/Genap) dari tahun akademik
            // Contoh: 20251 -> Ganjil, 20252 -> Genap
            $jenisSemester = (int)substr($ta_aktif['tahun_akademik'], -1) % 2;

            if ($jenisSemester == 1) { // Ganjil
                $semesterDitawarkan = [1, 3, 5, 7];
            } else { // Genap
                $semesterDitawarkan = [2, 4, 6, 8];
            }

            // Ambil mata kuliah yang sesuai dengan jurusan dan semester yang ditawarkan
            $matakuliahTersedia = $matakuliahModel
                ->where('jurusan_id', $mahasiswa['jurusan_id'])
                ->whereIn('semester', $semesterDitawarkan)
                ->findAll();