app/Controllers/TahunAkademik.php

SELECT *
FROM "tahun_akademik"
ORDER BY "tahun_akademik" DESC
---
    public function index()
    {
        $model = new TahunAkademikModel();
        $data = [
            'title'         => 'Data Tahun Akademik',
            'tahunakademik' => $model->orderBy('tahun_akademik', 'DESC')->findAll()