app/Models/IpBlockModel.php

    public function isIpBlocked(string $ipAddress): bool
    {
        return $this->where('ip_address', $ipAddress)->countAllResults() > 0;
---
SELECT COUNT(*) AS "numrows"
FROM "auth"."ip_blocks"
WHERE "ip_address" = '::1'