app/Models/UserModel.php

SELECT *
FROM "auth"."users"
WHERE "email" = 'isnansetiawan160@gmail.com'
OR "username" = 'isnansetiawan160@gmail.com'
 LIMIT 1
---
    public function getDataUserByEmail(string $parameter1)
    {
        return $this->where('email', $parameter1)
            ->orWhere('username', $parameter1)
            ->first();